%%%=============================================================================
%%% @author z.hua
%%% @doc
%%%
%%% @end
%%%=============================================================================

-module(sdk_fenghong).

%% API
-export([verify/5]).

%%%-----------------------------------------------------------------------------
%%% API Functions
%%%-----------------------------------------------------------------------------
verify(GameChan, Account, Token, SDKArgs, IP) ->
	Path = case GameChan of
		"114623" -> % 峰宏越狱1
			"/api/fenghongyy1/verify";
		"114626" -> % 峰宏正版1
			"/api/fenghongzb1/verify";
		"114627" -> % 峰宏正版2
			"/api/fenghongzb2/verify";
		"114628" -> % 峰宏正版3
			"/api/fenghongzb3/verify"
	end,
	sdk_common:verify(Path, GameChan, Account, Token, SDKArgs, IP).

%%%-----------------------------------------------------------------------------
%%% Internal Functions
%%%-----------------------------------------------------------------------------
