-module(scene_actor_11009).

-include("proto.hrl").

-compile([export_all]).
-compile(nowarn_export_all).

%% 传送点
get_portal(110091) ->
	{#p_coord{x=4509,y=2595},11008,#p_coord{x=4179,y=7259}};
get_portal(110092) ->
	{#p_coord{x=3915,y=7604},11011,#p_coord{x=1206,y=1360}};
get_portal(_) ->
	undefined.

%% 出生点
get_born() ->
	[
		#p_coord{x=3879, y=2600},
		#p_coord{x=3900, y=2600},
		#p_coord{x=3920, y=2600},
		#p_coord{x=3940, y=2600},
		#p_coord{x=3879, y=2620},
		#p_coord{x=3900, y=2620},
		#p_coord{x=3920, y=2620},
		#p_coord{x=3940, y=2620},
		#p_coord{x=3960, y=2620},
		#p_coord{x=3979, y=2620},
		#p_coord{x=3879, y=2639},
		#p_coord{x=3900, y=2639},
		#p_coord{x=3920, y=2639},
		#p_coord{x=3940, y=2639},
		#p_coord{x=3960, y=2639},
		#p_coord{x=3979, y=2639},
		#p_coord{x=3900, y=2660},
		#p_coord{x=3920, y=2660},
		#p_coord{x=3940, y=2660},
		#p_coord{x=3960, y=2660},
		#p_coord{x=3979, y=2660}
	].

%% 复活点
get_reborn() ->
	[
		#p_coord{x=3900, y=2560},
		#p_coord{x=3920, y=2560},
		#p_coord{x=3940, y=2560},
		#p_coord{x=3960, y=2560},
		#p_coord{x=3979, y=2560},
		#p_coord{x=4000, y=2560},
		#p_coord{x=3900, y=2580},
		#p_coord{x=3920, y=2580},
		#p_coord{x=3940, y=2580},
		#p_coord{x=3960, y=2580},
		#p_coord{x=3979, y=2580},
		#p_coord{x=4000, y=2580},
		#p_coord{x=4020, y=2580},
		#p_coord{x=4040, y=2580},
		#p_coord{x=3900, y=2600},
		#p_coord{x=3920, y=2600},
		#p_coord{x=3940, y=2600},
		#p_coord{x=3960, y=2600},
		#p_coord{x=3979, y=2600},
		#p_coord{x=4000, y=2600},
		#p_coord{x=4020, y=2600},
		#p_coord{x=4040, y=2600},
		#p_coord{x=3979, y=2620},
		#p_coord{x=4000, y=2620},
		#p_coord{x=4020, y=2620},
		#p_coord{x=4040, y=2620}
	].

%% 跳跃点
get_jump() ->
	[
	].

%% 安全区
get_safe() ->
	[
	].

%% 寻宝区
get_hunt() ->
	[
	].

%% NPC 列表
get_npcs() ->
	[
		{ 1901,#p_coord{x=3474, y=2663 } },
		{ 1902,#p_coord{x=598, y=2971 } },
		{ 1903,#p_coord{x=4472, y=621 } },
		{ 1904,#p_coord{x=7531, y=4559 } },
		{ 1905,#p_coord{x=2695, y=7291 } }
	].

%% 怪物列表
get_creeps() ->
	[
		{ 1100901,#p_coord{x=2205, y=3722 } },
		{ 1100901,#p_coord{x=2220, y=3552 } },
		{ 1100901,#p_coord{x=2550, y=3661 } },
		{ 1100901,#p_coord{x=2463, y=3854 } },
		{ 1100901,#p_coord{x=2028, y=3888 } },
		{ 1100901,#p_coord{x=2220, y=4065 } },
		{ 1100901,#p_coord{x=1819, y=3759 } },
		{ 1100901,#p_coord{x=2727, y=3777 } },
		{ 1100901,#p_coord{x=1687, y=3902 } },
		{ 1100901,#p_coord{x=1838, y=3495 } },
		{ 1100902,#p_coord{x=2426, y=1432 } },
		{ 1100902,#p_coord{x=2475, y=1703 } },
		{ 1100902,#p_coord{x=1959, y=1452 } },
		{ 1100902,#p_coord{x=2454, y=1193 } },
		{ 1100902,#p_coord{x=2762, y=1561 } },
		{ 1100902,#p_coord{x=2895, y=1298 } },
		{ 1100902,#p_coord{x=2062, y=1218 } },
		{ 1100902,#p_coord{x=2139, y=1679 } },
		{ 1100902,#p_coord{x=3051, y=1476 } },
		{ 1100902,#p_coord{x=1745, y=1306 } },
		{ 1100903,#p_coord{x=6138, y=1762 } },
		{ 1100903,#p_coord{x=6188, y=2026 } },
		{ 1100903,#p_coord{x=5724, y=1830 } },
		{ 1100903,#p_coord{x=5938, y=1571 } },
		{ 1100903,#p_coord{x=6529, y=1638 } },
		{ 1100903,#p_coord{x=6488, y=1888 } },
		{ 1100903,#p_coord{x=5929, y=2045 } },
		{ 1100903,#p_coord{x=6793, y=1730 } },
		{ 1100903,#p_coord{x=6188, y=1435 } },
		{ 1100903,#p_coord{x=5511, y=1630 } },
		{ 1100904,#p_coord{x=4002, y=5306 } },
		{ 1100904,#p_coord{x=4245, y=5152 } },
		{ 1100904,#p_coord{x=4265, y=5452 } },
		{ 1100904,#p_coord{x=3865, y=5559 } },
		{ 1100904,#p_coord{x=3779, y=5095 } },
		{ 1100904,#p_coord{x=4054, y=5011 } },
		{ 1100904,#p_coord{x=4097, y=5650 } },
		{ 1100904,#p_coord{x=3234, y=5327 } },
		{ 1100904,#p_coord{x=4445, y=5265 } },
		{ 1100904,#p_coord{x=3586, y=5386 } },
		{ 1100905,#p_coord{x=6274, y=6423 } },
		{ 1100905,#p_coord{x=6075, y=6243 } },
		{ 1100905,#p_coord{x=6345, y=6091 } },
		{ 1100905,#p_coord{x=6591, y=6243 } },
		{ 1100905,#p_coord{x=6041, y=6641 } },
		{ 1100905,#p_coord{x=5729, y=6412 } },
		{ 1100905,#p_coord{x=6340, y=6781 } },
		{ 1100905,#p_coord{x=6575, y=6658 } },
		{ 1100905,#p_coord{x=6858, y=6434 } },
		{ 1100905,#p_coord{x=5797, y=6695 } }
	].

%% 寻路点
get_waypoint() ->
	[
	].
