-module(scene_actor_11001).

-include("proto.hrl").

-compile([export_all]).
-compile(nowarn_export_all).

%% 传送点
get_portal(110011) ->
	{#p_coord{x=9055,y=669},11002,#p_coord{x=6595,y=459}};
get_portal(_) ->
	undefined.

%% 出生点
get_born() ->
	[
		#p_coord{x=759, y=9100},
		#p_coord{x=780, y=9100},
		#p_coord{x=759, y=9120},
		#p_coord{x=780, y=9120}
	].

%% 复活点
get_reborn() ->
	[
		#p_coord{x=800, y=9100},
		#p_coord{x=819, y=9100},
		#p_coord{x=800, y=9120},
		#p_coord{x=819, y=9120}
	].

%% 跳跃点
get_jump() ->
	[
		#p_coord{x=2212, y=8429},
		#p_coord{x=3429, y=7011},
		#p_coord{x=7808, y=7748},
		#p_coord{x=9048, y=7233},
		#p_coord{x=8727, y=6551},
		#p_coord{x=8309, y=5368},
		#p_coord{x=2905, y=3047},
		#p_coord{x=1089, y=2268}
	].

%% 安全区
get_safe() ->
	[
	].

%% 寻宝区
get_hunt() ->
	[
	].

%% NPC 列表
get_npcs() ->
	[
		{ 1101,#p_coord{x=5086, y=7480 } },
		{ 1102,#p_coord{x=5845, y=7845 } },
		{ 1100,#p_coord{x=3731, y=6862 } },
		{ 1106,#p_coord{x=3522, y=3806 } },
		{ 1109,#p_coord{x=3622, y=3775 } },
		{ 1104,#p_coord{x=7694, y=5668 } },
		{ 1107,#p_coord{x=2827, y=1105 } },
		{ 1108,#p_coord{x=6034, y=1102 } },
		{ 1103,#p_coord{x=8800, y=6918 } },
		{ 1105,#p_coord{x=5618, y=5558 } },
		{ 1110,#p_coord{x=9086, y=840 } },
		{ 1110,#p_coord{x=8950, y=938 } },
		{ 1111,#p_coord{x=8106, y=800 } },
		{ 1112,#p_coord{x=6659, y=8223 } }
	].

%% 怪物列表
get_creeps() ->
	[
		{ 1100101,#p_coord{x=4195, y=7045 } },
		{ 1100101,#p_coord{x=4429, y=7168 } },
		{ 1100101,#p_coord{x=4677, y=7298 } },
		{ 1100100,#p_coord{x=1659, y=8733 } },
		{ 1100103,#p_coord{x=4822, y=3906 } },
		{ 1100108,#p_coord{x=3791, y=1038 } },
		{ 1100108,#p_coord{x=3458, y=1211 } },
		{ 1100108,#p_coord{x=3413, y=897 } },
		{ 1100108,#p_coord{x=3725, y=1289 } },
		{ 1100108,#p_coord{x=3688, y=877 } },
		{ 1100108,#p_coord{x=3963, y=1298 } },
		{ 1100108,#p_coord{x=4199, y=1139 } },
		{ 1100108,#p_coord{x=3938, y=931 } },
		{ 1100108,#p_coord{x=3791, y=1494 } },
		{ 1100108,#p_coord{x=3565, y=1088 } },
		{ 1100111,#p_coord{x=5265, y=1172 } },
		{ 1100112,#p_coord{x=5445, y=1118 } },
		{ 1100113,#p_coord{x=5418, y=1238 } },
		{ 1100104,#p_coord{x=9450, y=6941 } },
		{ 1100107,#p_coord{x=1457, y=1322 } },
		{ 1100107,#p_coord{x=1464, y=1477 } },
		{ 1100107,#p_coord{x=1464, y=1643 } },
		{ 1100107,#p_coord{x=1645, y=1632 } },
		{ 1100107,#p_coord{x=1664, y=1484 } },
		{ 1100107,#p_coord{x=1664, y=1322 } },
		{ 1100107,#p_coord{x=1261, y=1328 } },
		{ 1100107,#p_coord{x=1272, y=1481 } },
		{ 1100107,#p_coord{x=1278, y=1646 } },
		{ 1100107,#p_coord{x=1078, y=1494 } },
		{ 1100107,#p_coord{x=1837, y=1484 } },
		{ 1100105,#p_coord{x=6523, y=5066 } },
		{ 1100105,#p_coord{x=6713, y=5200 } },
		{ 1100105,#p_coord{x=6745, y=5054 } },
		{ 1100105,#p_coord{x=6987, y=5083 } },
		{ 1100105,#p_coord{x=6955, y=5256 } },
		{ 1100105,#p_coord{x=6423, y=5243 } },
		{ 1100105,#p_coord{x=6705, y=5429 } },
		{ 1100105,#p_coord{x=6968, y=5461 } },
		{ 1100105,#p_coord{x=6395, y=5470 } }
	].

%% 寻路点
get_waypoint() ->
	[
	].
