% Automatically generated, do not edit
-module(cfg_marriage).

-compile([export_all]).
-compile(nowarn_export_all).

-include("enum.hrl").

intimacy() -> 520. % "亲密度要求"
auto_refuse() -> 1800. % "自动拒绝等待的时间（S）"
level() -> 213. % "求婚等级要求"
npc() -> 1310. % "结婚NPC"
ring_upitem() -> 11141. % "婚戒升级道具"
appointment_reward() -> [{11142,2}]. % "预约后双方获得的邮件奖励"
invite() -> 20. % "邀请上限"
invite_add() -> [{90010004,250}]. % "增加一个邀请名额消耗"
invite_accept() -> [{11142,2}]. % "同意邀请的奖励"
activity() -> 10124. % "活动ID，对应activity.xlsx"
exp_interval() -> 10. % "经验增加间隔"
exp_coef() -> 120. % "经验系数"
food() -> [{11314001,1543,1370},{11314001,3259,2219},{11314001,1479,2492},{11314001,1995,1326},{11314001,3415,2000}]. % "结婚蛋糕"
candy() -> [{11314002,3669,987},{11314002,3737,1353},{11314002,3176,1231},{11314002,3039,1781},{11314002,3210,1650},{11314002,2700,1503},{11314002,3696,1767},{11314003,2290,1345},{11314003,1651,1198},{11314003,3039,1781},{11314003,2299,2025},{11314003,1890,2466},{11314003,1256,2411}]. % "两个喜糖都在这"
food_limit() -> 10. % "美食上限"
candy_limit() -> 5. % "喜糖上限"
food_add() -> 10. % "美食增加的热度"
candy_add() -> 10. % "喜糖增加的热度"
appointment_show() -> [{90010018,1},{11141,1},{100032,1},{100041,1},{50000,1},{10303,1}]. % "婚礼预约界面展示奖励"
low_fire() -> 11142. % "普通烟花"
high_fire() -> 11143. % "高级烟花"
